import * as React from 'react';
import { useTranslation } from 'react-i18next';
import { Link } from 'react-router-dom';
import Love from '../../Components/Footer/love';

import { H1, P1 } from '../../Components/Text';
import useTitle, { useDescription } from '../../Helpers/useTitle';
import { GoBack } from '../Registration/registration';

import './index.scss';

const AboutStatsPage = () => {
  const { t } = useTranslation();
  
  useTitle(t('title') + ' — ' + t('title-rating-about'));
  useDescription(t('description-rating-about'));


  return (
    <div className="AboutStatsPage">
      {/* <Helmet>
        <title>StudSearch — Політика конфіденційності</title>
        <meta name="title" content="StudSearch — Політика конфіденційності" />
        <meta property="og:title" content="StudSearch — Політика конфіденційності" />
        <meta name="twitter:title" content="StudSearch — Політика конфіденційності" />
      </Helmet> */}
      <div className="Content">
        <GoBack to='/rating/' />
        <br />
        <br />
        <h1>Рейтинги Університетів</h1>
        <h3 style={{ textAlign: 'center' }}>Як вони рахуються та як їх слід використовувати</h3>
        <br />
        <P1><b>Місія нашого рейтингу - надати зручний інструмент для порівняння університетів між собою.</b></P1>
        <br />
        <P1>Ми були абітурієнтами і знаємо, як багато часу треба витратити, щоб знайти в яких університетах є цікавлячі спеціальності, дізнатись на яких факультетах вони є, а ще й якось порівняти їх між собою!</P1>
        <br />
        <P1><b>Тому ми зробили цей інструмент, щоб спростити життя вступникам!</b></P1>
        <br />
        <br />
        <br />
        <h3>Це не тільки рейтинг!</h3>
        <P1>Це зручний спосіб знайти університети за такими параметрами: галузь, спеціальність, регіон, бюджет / контракт.</P1>
        <br />
        <P1>Ми намагалися зробити максимально зручний інструмент, щоб можна було швидко побачити:</P1>
        <ul className='ul'>
          <li className='li'><P1>В яких закладах вищої освіти є конкретні галузі / спеціальності / факультети</P1></li>
          <li className='li'><P1>Які факультети є в цих закладах</P1></li>
          <li className='li'><P1>Які спеціальності є на кожному факультеті</P1></li>
          <li className='li'><P1>Які факультети можна обрати на спеціальності</P1></li>
          <li className='li'><P1>Рейтинг факультетів і спеціальностей по університетам</P1></li>
        </ul>
        <br />
        <br />
        <h3>Це тільки рейтинг!</h3>
        <P1>Авжеж, цей рейтинг <b>не</b> повинен стати єдиним критерієм у виборі твого майбутнього шляху!</P1>
        <P1><b>Наш рейтинг показує середній рівень підготовки абітурієнтів, які поступили у цей університет на цей факультет чи на цю спеціальність.</b></P1>
        <br />
        <P1>Наше припущення полягає у тому, що якщо у цей університет чи на цю спеціальність поступають абітурієнти з високими балами ЗНО, то, <b>мабуть</b>, тут навчають добре і тут вчаться розумні студенти.</P1>
        <P1>Ми не хочемо нав’язувати своєї думки, а закликаємо робити свій вибір самостійно та свідомо, базуючись на максимальній кількості джерел інформації.</P1>
        <br />
        <P1>Читай офіційні джерела (університетські сайти та медіа), читай неофіційні джерела інформації (наприклад, студентські чати та канали), запитай друзів та знайомих, <Link to="/">поспілкуйся з нашими студентами-волонтерами</Link> та стався критично до кожної думки, бо вона суб’єктивна!</P1>
        <br />
        <P1>Ми зробили StudSearch саме для того, щоб в абітурієнтів було більше незалежних джерел інформації про якість освіти в Україні <Love /></P1>
        <br />
        <br />
        <br />
        <h3>Як рахується рейтинг?</h3>
        <P1>Рейтинг базується на <a href="https://vstup.edbo.gov.ua/">даних з ЄДЕБО</a> про вступну кампанію 2020 року.</P1>
        <P1>Ми зосередилися на рівні підготовки абітурієнтів, які <b>вступили</b> на відповідні спеціальності.</P1>
        <br />
        <P1>Рейтинг рахується на основі середнього конкурсного балу на спеціальність, зваженого на <b>частку зарахованих на навчання</b> абітурієнтів на неї в загальної кількості абітурієнтів, зарахованих на навчання у цьому ЗВО.</P1>
        <br />
        <P1>Наприклад, у ЗВО по галузі <u>Інформаційні технології</u> є лише дві спеціальності:
          <br />На першу зараховано на навчання 20 абітурієнтів, середній конкурсний балл ЗНО - <b>140</b>.
          <br />На другу зараховано на навчання 80 абітурієнтів середній конкурсний балл ЗНО - <b>190</b>.
        </P1>
        <P1>Якщо рахувати середнє арифметичне, то отримаємо (<b>140</b> + <b>190</b>) / 2 = <b>165</b> балів. Проте, ця цифра не буде достатньо добре описувати рівень підготовки абітурієнтів, які поступили у цей ЗВО.</P1>
        <P1>
          Наш підхід полягає у знаходженні зваженого середнього конкурсного балу вступників.
          <br />
          Для цього ми множимо середній бал спеціальності на частку вступників на неї, від загальної кількості вступників до цього ЗВО. У розрахунках враховуються лише бали абітурієнтів, які були зараховані на навчання на конкретну конкурсну позицію.
        </P1>
        <P1>У нашому прикладі: (<b>140</b> * 0.2) + (<b>190</b> * 0.8) = <b>180</b> балів.</P1>
      </div>
    </div>
  )
}

export default AboutStatsPage;
