import * as React from 'react';
import { Helmet } from 'react-helmet';
import { useTranslation } from 'react-i18next';

import { H1 } from '../../Components/Text';
import useTitle from '../../Helpers/useTitle';
import { GoBack } from '../Registration/registration';

import './index.scss';

const PrivacyPolicyPage = () => {
  const { t } = useTranslation();
  
  useTitle(t('title') + ' — ' + t('title-privacy-policy'));

  return (
    <div className="PrivacyPolicy">
      {/* <Helmet>
        <title>StudSearch — Політика конфіденційності</title>
        <meta name="title" content="StudSearch — Політика конфіденційності" />
        <meta property="og:title" content="StudSearch — Політика конфіденційності" />
        <meta name="twitter:title" content="StudSearch — Політика конфіденційності" />
      </Helmet> */}
      <div className="Content">
        <GoBack />
        <br />
        <br />
        <h1>Політика конфіденційності</h1>
        <p>Цей документ «Політика конфіденційності» (далі - за текстом - «Політика») являє собою правила використання сайтом - studsearch.org (далі - Організація) персональної інформації Користувача, яку Організація, включаючи всіх осіб, що входять в одну групу з Організацією, можуть отримати про Користувача під час використання ним будь-якого з сайтів, сервісів, служб, програм, продуктів або послуг Організації (далі - Сайт) і в ході виконання Сайтом будь-яких угод і договорів з Користувачем. Згода Користувача з Політикою, висловлену ним в рамках відносин з одним з перерахованих осіб, поширюється на всі інші перераховані особи. Використання Сайту означає беззастережну згоду Користувача з цією Політикою і зазначеними в ній умовами обробки його персональної інформації; в разі незгоди з цими умовами користувач повинен утриматися від використання Сайту.</p>
        <p>1. Загальні положення політики конфіденційності Організації</p>
        <p>1.1. Нинішня політика конфіденційності Організації складена відповідно до Закону України «Про захист персональних даних», а також іншими нормативно-правовими актами України в області захисту і обробки персональних даних і діє по відношенню до всіх персональних даних, які Сайт може отримати від Користувача, що є стороною по цивільно правовим договором.</p>
        <p>1.2. Організація має право вносити зміни в справжню Політику. При внесенні змін до заголовку політики конфіденційності Організації вказується дата останнього оновлення редакції. Нова редакція політики конфіденційності Організації вступає в силу з моменту її розміщення на сайті, якщо інше не передбачено новою редакцією політики конфіденційності Організації.</p>
        <p>1.3. До Нинішньої політики конфіденційності Організації, включаючи тлумачення її положень і порядок прийняття, виконання, зміни та припинення, підлягає застосуванню законодавство України.</p>
        <p>1.4. Основною метою цієї політики конфіденціїності є створення основи для дотримання прав і свобод людини і громадянина при обробці його персональних даних послуг Організації.</p>
        <p>2. Персональна інформація користувачів, яку обробляє Сайт</p>
        <p>2.1. Під персональними даними в цій політиці конфіденційності розуміється:</p>
        <p>2.1.1. інформація, що надається Користувачем самостійно при реєстрації (створення облікового запису) або в процесі використання послугами Організації, включаючи персональні дані Користувача (ім'я, університет, спеціальність, факультет та на якому курсі вчиться Користувач, посилання на соціальні мережі Користувача). Обов'язкова для надання послуг Організації інформація позначена спеціальним чином. Інша інформація надається Користувачем на його розсуд;</p>
        <p>2.1.2. дані, які передаються в автоматичному режимі Сайту в процесі їх використання за допомогою встановленого на пристрої Користувача програмного забезпечення, в тому числі IP-адреса, дані файлів cookie, інформація про браузер Користувача (або іншої програми, за допомогою якої здійснюється доступ до Сайту), унікальні ідентифікатори акаунтів соціальних мереж Користувача, технічні характеристики обладнання і програмного забезпечення, що використовуються Користувачем, дата і час доступу до Сайту, адреси запитуваних сторінок і інша подібна інформація;</p>
        <p>2.2. Обробка персональних даних Сайтом здійснюється в наступних випадках:</p>
        <p>2.2.1. зі згоди суб'єкта персональних даних (Користувача) на обробку його персональних даних;</p>
        <p>2.2.2. для виконання договору, стороною якого, або вигодонабувачем або поручителем за яким є суб'єкт персональних даних (Користувач), в тому числі в разі реалізації послуг Організації свого права на поступку прав (вимог) за таким договором, а також для укладення договору по ініціативою суб'єкта персональних даних (Користувача) або договору, за яким суб'єкт персональних даних буде вигодонабувачем або поручителем;</p>
        <p>2.2.3. для здійснення прав і законних інтересів послуг Організації або третіх осіб, або для досягнення суспільно значущих цілей за умови, що при цьому не порушуються права і свободи суб'єкта персональних даних (Користувача);</p>
        <p>2.2.4. при необхідності здійснення правосуддя, виконання судового акту, акту іншого органу або посадової особи, що підлягає виконанню відповідно до законодавства України про виконавче провадження;</p>
        <p>2.2.5. в випадку, коли доступ необмеженого кола осіб до персональних даних суб'єкта (Користувача) надано самим суб'єктом персональних даних, або на його прохання (далі - персональні дані, зроблені загальнодоступними суб'єктом персональних даних);</p>
        <p>2.2.6. в статистичних чи інших дослідницьких цілях, за умови обов'язкового знеособлення персональних даних.</p>
        <p>2.3. Обробка спеціальних категорій персональних даних, що стосуються расової, національної приналежності, політичних поглядів, релігійних або філософських переконань, стану здоров'я, інтимного життя, судимості, а також біометричних персональних даних послугами Організації не провадиться. Обробка зазначених даних можлива послугами Організації тільки на підставі згоди Користувача в письмовій формі.</p>
        <p>2.4. Нинішня політика конфіденційності Організації може бути застосована тільки до інформації, що обробляється в ході використання Сайту. Сайт не контролює і не несе відповідальність за обробку інформації сайтами третіх осіб, на які Користувач може перейти за посиланнями, які доступні на Сайті.</p>
        <p>2.5. Послуги Організації не перевіряють достовірність персональної інформації, наданої Користувачем, і не мають можливості оцінювати його дієздатність.</p>
        <p>3. Цілі обробки персональних даних користувачів</p>
        <p>3.1. Сайт обробляє персональні дані Користувача в наступних цілях:</p>
        <p>3.1.1. виконання договору, стороною якого, або вигодонабувачем або поручителем за яким є суб'єкт персональних даних (Користувач), а також укладення договору з ініціативи Користувача або договору, за яким Користувач буде вигодонабувачем або поручителем;</p>
        <p>3.1.2. виконання запитів уповноважених органів державної влади, в тому числі органів оперативно-розшукової діяльності;</p>
        <p>3.1.3. ідентіфікація сторони в рамках сервісів, угод і договорів із сайтом;</p>
        <p>3.1.4. надання Користувачеві персоналізованих сервісів і послуг;</p>
        <p>3.1.5. виконання запитів користувачів, напрямок повідомлень і інформації, що стосуються використання Організації за запитами Користувачів;</p>
        <p>3.1.6. покращення якості роботи послуг Організації, зручності його використання для Користувача, розробка нових послуг і сервісів;</p>
        <p>3.1.7. таргетування рекламних матеріалів;</p>
        <p>3.1.8. проведення статистичних та інших досліджень на основі знеособлених даних.</p>
        <p>4. Умови передачі персональної інформації користувачів третім особам</p>
        <p>4.1. Відносно персональної інформації Користувача зберігається її конфіденційність, крім випадків добровільного надання Користувачем інформації про себе для загального доступу необмеженому колу осіб.</p>
        <p>4.2. Сайт має право передати персональну інформацію Користувача третім особам в наступних випадках:</p>
        <p>4.3.1. користувач висловив згоду або дав доручення послугам Організації (наприклад, при реєстрації доменного імені у уповноваженого реєстратора) на такі дії;</p>
        <p>4.3.2. передача необхідна для використання Користувачем певного сервісу або для виконання певної угоди або договору з Користувачем;</p>
        <p>4.3.3. передача необхідна для функціонування і працездатності самого послугам Організації;</p>
        <p>4.3.4. передача передбачена відповідним законодавством в рамках встановленої законодавством процедури;</p>
        <p>4.3.5. така передача відбувається в рамках продажу або іншої передачі бізнесу (повністю або в частині), при цьому до набувача переходять всі зобов'язання по дотриманню умов цієї Політики стосовно отриманої їм персональної інформації;</p>
        <p>4.3.6. з метою забезпечення можливості захисту прав і законних інтересів послуг Організації або третіх осіб у випадках, коли Користувач порушує Угоду послугам Організації, нинішню Політику, або документи, що містять умови використання конкретних сервісів;</p>
        <p>4.3.7. в результаті обробки персональної інформації Користувача шляхом її знеособлення отримані знеособлені статистичні дані, які передаються третій особі для проведення досліджень, виконання робіт або надання послуг за дорученням послуг Організації.</p>
        <p>5. Зміна та видалення персональної інформації</p>
        <p>Обов'язкове зберігання даних</p>
        <p>5.1. Користувач може в будь-який момент змінити (оновити, доповнити) надану їм персональну інформацію або її частина, звернувшись до Сайту по контактам в розділі 9. «Контакти».</p>
        <p>6. Обробка персональних даних за допомогою файлів Cookie та лічильників</p>
        <p>6.1. Файли cookie, передані Сайтом обладнання Користувача і обладнанням Користувача Сайту, можуть використовуватися Сайтом для надання Користувачеві персоналізованих сервісів, для таргетування реклами, яка показується Користувачеві, в статистичних та дослідницьких цілях, а також для поліпшення Сайту.</p>
        <p>6.2. Користувач усвідомлює, що обладнання та програмне забезпечення, які він використовував для відвідування сайтів в мережі інтернет можуть володіти функцією заборони операцій з файлами cookie (для будь-яких сайтів або для певних сайтів), а також видалення раніше отриманих файлів cookie.</p>
        <p>6.2. Користувач усвідомлює, що обладнання та програмне забезпечення, які він використовував для відвідування сайтів в мережі інтернет можуть володіти функцією заборони операцій з файлами cookie (для будь-яких сайтів або для певних сайтів), а також видалення раніше отриманих файлів cookie. </p>
        <p>6.3. Сайт вправі встановити, що надання певного сервісу або послуги можливо тільки за умови, що прийом та отримання файлів cookie дозволені Користувачем.</p>
        <p>6.4. Структура файлу cookie, його зміст і технічні параметри визначаються Сайтом і можуть змінюватися без попереднього повідомлення Користувача.</p>
        <p>6.5. Лічильники, розміщені Сайтом, можуть використовуватися для аналізу файлів cookie Користувача, для збору і обробки статистичної інформації про використання Сайту, а також для забезпечення працездатності Сайту в цілому або їх окремих функцій зокрема. Технічні параметри роботи лічильників визначаються Сайтом і можуть змінюватися без попереднього повідомлення Користувача.</p>
        <p>7. Захист персональної інформації Користувача</p>
        <p>7.1. Сайт вживає необхідні і достатні організаційні та технічні заходи для захисту персональної інформації Користувача від неправомірного або випадкового доступу, знищення, перекручення, блокування, копіювання, поширення, а також від інших неправомірних дій з нею третіх осіб.</p>
        <p>8. Зміна політики конфіденційності Організації</p>
        <p>8.1. Сайт має право вносити зміни в справжню Політику конфіденційності. При внесенні змін до актуальної редакції вказується дата останнього оновлення. Нова редакція Політики вступає в силу з моменту її розміщення, якщо інше не передбачено новою редакцією політики конфіденційності Організації. </p>
        <p>9. Контакти і питання щодо персональних даних</p>
        <p>9.1. Всі пропозиції, питання, запити та інші звернення з приводу цієї Політики і використання своїх персональних даних Користувач має право направляти Сайту:</p>
        <ul>
          <li>за адресою електронної пошти: studsearch.info@gmail.com або dkaraush@gmail.com;</li>
          <li>— по телефону: +38 (066) 018-38-45</li>
        </ul>
      </div>
    </div>
  )
}

export default PrivacyPolicyPage;
